{
    "HSBC": {
        "title": "HSBC BANK ARGENTINA S.A.",
        "body": "Durante mis pruebas en un aplicativo web de productos financieros, encontré una vulnerabilidad de seguridad. Esta vulnerabilidad radicaba en el módulo de validación de identidad, donde se requería una foto del anverso y reverso del DNI, así como una selfie. Noté que el sistema solo contrastaba la foto del DNI con la selfie, sin verificar otros datos del anverso, como el número de DNI. Movido por la intuición, realicé una prueba donde dibujé únicamente el marco del DNI y añadí mi propia foto de carnet para simular el anverso. A pesar de que el sistema no debería haberlo permitido, logré crear cuentas financieras sin una verificación adecuada de los datos de identidad. En resumen, en ese momento, el sistema de validación de identidad a través de selfies en producción no era seguro. Esto permitía a las personas suplantar la identidad de otros al subir una foto y algunos datos personales, lo que posibilitaba la apertura de productos financieros a nombre de terceros y su uso posterior."
    },
    "ECOSISTEMAS": {
        "title": "Ecosistemas",
        "body": "Durante mi labor de QA con DIA (cliente de Ecosistemas), colaboré cercanamente con el equipo de desarrollo encargado de la electrónica de sensores, empleando placas Arduino para geolocalización, temperaturas y consumo energético en heladeras móviles. Con mi experiencia en robótica y programación, ofrecí recomendaciones clave para resolver problemas, como en el caso de una heladera con dificultades de conexión debido a cables. Propuse la solución de usar una batería de litio específica y un protector de carga, además de la configuración de energía para una Wemos D1 que luego se implementó en producción."
    },
    "FRAVEGA": {
        "title": "Frávega",
        "body": "Al inicio de mi participación en el proyecto, nos encontramos con restricciones de tiempo que necesitábamos superar. Para mejorar la eficiencia, decidí automatizar la generación de códigos EAN13 utilizando programación en Visual Basic .NET. Esta iniciativa permitió la creación de códigos válidos en cuestión de segundos, en contraste con la alternativa manual que implicaba generar códigos a través de una página web con captchas. Es relevante resaltar que los códigos generados no eran aleatorios, ya que incorporaban un dígito de verificación que requería cálculos complejos. Pocos días después, fui convocado por mi líder y su supervisor para analizar la viabilidad de automatizar la carga masiva de productos en diversas categorías (una tarea que consumía la mayoría del tiempo en las pruebas). Basándome en mis conocimientos de programación, acepté el reto y automatizé este proceso empleando coordenadas. Esto implicó el control preciso del teclado y el ratón a través de las coordenadas de la matriz de píxeles de la pantalla. Dado que no se trataba de una aplicación web con elementos manipulables, esta fue la única metodología viable. Esta solución fue de vital importancia para cumplir con los plazos del proyecto, ya que agilizó significativamente la finalización de tareas fundamentales."
    }
}